Revit 2024 API
DirectShape.AddReferenceCurve Method
Overload List
Name | Description
AddReferenceCurve(Curve)
 Adds a reference curve to the DirectShape.
AddReferenceCurve(Curve, DirectShapeReferenceOptions)
 Adds a reference curve to the DirectShape.
See Also
DirectShape Class
DirectShape Members
Autodesk.Revit.DB Namespace